package main.java.chapter.chapter2.variantB;

public class Main {

	public static void main(String[] args) {
		System.out.println("1. Упорядочить строки (столбцы) матрицы в порядке возрастания значений элементов k-го столбца (строки).");
		System.out.println("2. Выполнить циклический сдвиг заданной матрицы на k позиций вправо (влево, вверх, вниз).");
		System.out.println("3. Найти и вывести наибольшее число возрастающих (убывающих) элементов матрицы, идущих подряд.");
		System.out.println("4. Найти сумму элементов матрицы, расположенных между первым и вторым положительными элементами каждой строки.");
		System.out.println("5. Транспонировать квадратную матрицу.");
		System.out.println("6. Вычислить норму матрицы.");
		System.out.println("7. Повернуть матрицу на 90 (180, 270) градусов против часовой стрелки.");
		System.out.println("8. Вычислить определитель матрицы.");
		System.out.println("9. Построить матрицу, вычитая из элементов каждой строки матрицы ее среднее арифметическое.");
		System.out.println("10. Найти максимальный элемент(ы) в матрице и удалить из матрицы все строки и столбцы, его содержащие.");
		System.out.println("11. Уплотнить матрицу, удаляя из нее строки и столбцы, заполненные нулями.");
		System.out.println("12. В матрице найти минимальный элемент и переместить его на место за-данного элемента путем перестановки строк и столбцов.");
		System.out.println("13. Преобразовать строки матрицы таким образом, чтобы элементы, рав-ные нулю, располагались после всех остальных.");
		System.out.println("14. Округлить все элементы матрицы до целого числа.");
		System.out.println("15. Найти количество всех седловых точек матрицы. (Матрица А имеет седловую точку Аi,j, если Аi,j является минимальным элементом в i-й строке и максимальным в j-м столбце).");
		System.out.println("16. Перестроить матрицу, переставляя в ней строки так, чтобы сумма эле-ментов в строках полученной матрицы возрастала.");
		System.out.println("17. Найти число локальных минимумов. (Соседями элемента матрицы назовем элементы, имеющие с ним общую сторону или угол. Элемент матрицы называется локальным минимумом, если он строго меньше всех своих соседей.)");
		System.out.println("18. Найти наибольший среди локальных максимумов. (Элемент матрицы называется локальным максимумом, если он строго больше всех своих соседей.)");
		System.out.println("19. Перестроить заданную матрицу, переставляя в ней столбцы так, чтобы значения их характеристик убывали. (Характеристикой столбца прямо-угольной матрицы называется сумма модулей его элементов).");
		System.out.println("20. Путем перестановки элементов квадратной вещественной матрицы до-биться того, чтобы ее максимальный элемент находился в левом верх-нем углу, следующий по величине – в позиции (2,2), следующий по ве-личине – в позиции (3,3) и т. д., заполнив таким образом всю главную диагональ.");
	}

}
