package main.java.chapter.chapter17.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("Создать сервлет и взаимодействующие с ним пакеты Java-классов и JSP-страницы, способные выполнить следующие действия:");
		System.out.println("1. Подсчет суммы случайным образом выбранных элементов массива.");
		System.out.println("2. Вывести полное название страны и языка.");
		System.out.println("3. Подсчитать время между выполнением сервлета и JSP в наносекундах. 11. Создать массив дат и вывести самую позднюю дату.");
		System.out.println("4. Задать температуру. Если она меньше нуля, вывести значение температуры синим цветом, если больше, то красным.");
		System.out.println("5. Создать приложение, выводящее фамилию разработчика, дату и время получения задания, а также дату и время его выполнения. ");
		}

}
