package main.java.chapter.chapter07.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("1. В каждом слове текста k-ю букву заменить заданным символом. Если k больше длины слова, корректировку не выполнять.");
		System.out.println("2. В русском тексте каждую букву заменить ее порядковым номером в алфавите. При выводе в одной строке печатать текст с двумя пробе-лами между буквами, в следующей строке внизу под каждой буквой печатать ее номер.");
		System.out.println("3. В тексте после буквы Р, если она не последняя в слове, ошибочно напе-чатана буква А вместо О. Внести исправления в текст.");
		System.out.println("4. В тексте слова заданной длины заменить указанной подстрокой, длина которой может не совпадать с длиной слова.");
		System.out.println("5. В тексте после k-го символа вставить заданную подстроку.");
		System.out.println("6. После каждого слова текста, заканчивающегося заданной подстрокой, вставить указанное слово.");
		System.out.println("7. В зависимости от признака (0 или 1) в каждой строке текста удалить указанный символ везде, где он встречается, или вставить его после k-гo символа.");
		System.out.println("8. Из небольшого текста удалить все символы, кроме пробелов, не явля-ющиеся буквами. Между последовательностями подряд идущих букв оставить хотя бы один пробел.");
		System.out.println("9. Из текста удалить все слова заданной длины, начинающиеся на соглас-ную букву.");
		System.out.println("10. Удалить из текста его часть, заключенную между двумя символами, ко-торые вводятся (например, между скобками ‘(’ и ‘)’ или между звездоч-ками ‘*’ и т.п.).");
		System.out.println("11. В тексте найти все пары слов, из которых одно является обращением другого.");
		System.out.println("12. Найти и напечатать, сколько раз повторяется в тексте каждое слово, ко-торое встречается в нем.");
		System.out.println("13. В тексте найти и напечатать n символов (и их количество), встречаю-щихся наиболее часто.");
		System.out.println("14. Найти, каких букв, гласных или согласных, больше в каждом предло-жении текста.");
		System.out.println("15. В стихотворении найти количество слов, начинающихся и заканчиваю-щихся гласной буквой.");
		System.out.println("16. Напечатать без повторения слова текста, у которых первая и последняя буквы совпадают.");
		System.out.println("17. В тексте найти и напечатать все слова максимальной и все  слова ми-нимальной длины.");
		System.out.println("18. Напечатать квитанцию об оплате телеграммы, если стоимость одного слова задана.");
		System.out.println("19. В стихотворении найти одинаковые буквы, которые встречаются во всех словах.");
		System.out.println("20. В тексте найти первую подстроку максимальной длины, не со-держащую букв.");
		System.out.println("21. В тексте определить все согласные буквы, встречающиеся не более чем в двух словах.");
		System.out.println("22. Преобразовать текст так, чтобы каждое слово начиналось с заглавной буквы.");
		System.out.println("23. Подсчитать количество содержащихся в данном тексте знаков препи-нания.");
		System.out.println("24. В заданном тексте найти сумму всех встречающихся цифр.");
		System.out.println("25. Из кода Java удалить все комментарии (//, /*, /**).");
		System.out.println("26. Дан текст на английском языке. Пусть все слова встречаются четное количество раз, за исключением одного. Определить это слово. При сравнении слов регистр не учитывать.");
		System.out.println("27. Определить сумму всех целых чисел, встречающихся в заданном тек-сте.");
		System.out.println("28. Из английского текста удалить все пробелы, если он разделяет два раз-личных знака препинания и если рядом с ним находится еще один про-бел.");
		System.out.println("29. Строка состоит из упорядоченных чисел от 0 до 100000, записанных подряд без пробелов. Определить, что будет подстрокой от позиции n до m.");
		System.out.println("30. Определить количество вхождений заданного слова в текст, игнорируя регистр символов и считая буквы «е», «ё», и «и», «й» одинаковыми.");
		System.out.println("31. Преобразовать текст так, чтобы только первые буквы каждого предло-жения были заглавными.");
		System.out.println("32. Заменить в тексте все шаблоны типа %user%Бендер%/user% на <a href=”http://www.my.by/search.htm?param=Бендер”>Бендер</a>.");
		System.out.println("33. В Java код добавить корректные getter и setter-методы для всех полей данного класса, при их отсутствии.");
		System.out.println("34. Вывести все предложения заданного текста в порядке возрастания количества слов в каждом из них.");	}

}
