package main.java.chapter.chapter10.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("1. Ввести строки из файла, записать в список. Вывести строки в файл в обратном порядке.");
		System.out.println("2. Ввести число, занести его цифры в стек. Вывести число, у которого цифры идут в обратном порядке.");
		System.out.println("3. Создать в стеке индексный массив для быстрого доступа к записям в бинарном файле.");
		System.out.println("4. Создать список из элементов каталога и его подкаталогов.");
		System.out.println("5. Создать стек из номеров записи. Организовать прямой доступ к эле-ментам записи.");
		System.out.println("6. Занести стихотворения одного автора в список. Провести сортировку по возрастанию длин строк.");
		System.out.println("7. Задать два стека, поменять информацию местами.");
		System.out.println("8. Определить множество на основе множества целых чисел. Создать методы для определения пересечения и объединения множеств.");
		System.out.println("9. Списки (стеки, очереди) I(1..n) и U(1..n) содержат результаты nизмерений тока и напряжения на неизвестном сопротивлении R. Найти приближенное число R методом наименьших квадратов.");
		System.out.println("10. С использованием множества выполнить попарное суммирование про-извольного конечного ряда чисел по следующим правилам: на первом этапе суммируются попарно рядом стоящие числа, на втором этапе суммируются результаты первого этапа и т.д. до тех пор, пока не оста-нется одно число.");
		System.out.println("11. Сложить два многочлена заданной степени, если коэффициенты много-членов хранятся в объекте HashMap.");
		System.out.println("12. Умножить два многочлена заданной степени, если коэффициенты мно-гочленов хранятся в различных списках.");
		System.out.println("13. Не используя вспомогательных объектов, переставить отрицательные элементы данного списка в конец, а положительные – в начало этого списка.");
		System.out.println("14. Ввести строки из файла, записать в список ArrayList. Выполнить сортировку строк, используя метод sort() из класса Collections.");
		System.out.println("15. Задана строка, состоящая из символов '(', ')', '[', ']', '{', '}'. Проверить пра-вильность расстановки скобок. Использовать стек.");
		System.out.println("16. Задан файл с текстом на английском языке. Выделить все различные слова. Слова, отличающиеся только регистром букв, считать одинако-выми. Использовать класс HashSet.");
		System.out.println("17. Задан файл с текстом на английском языке. Выделить все различные слова. Для каждого слова подсчитать частоту его встречаемости. Слова, отличающиеся регистром букв, считать различными. Использовать класс HashMap.");
		}

}
