package main.java.chapter.chapter04.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("Создать приложение, удовлетворяющее требованиям, приведенным в задании. Аргументировать принадлежность классу каждого создаваемого метода и корректно переопределить для каждого класса методы equals(), hashCode(), toString().");
		System.out.println("1. Создать объект класса Текст, используя класс Абзац. Методы: допол-нить текст, вывести на консоль текст, заголовок текста.");
		System.out.println("2. Создать объект класса Автомобиль, используя класс Колесо. Методы: ехать, заправляться, менять колесо, вывести на консоль марку автомо-биля.");
		System.out.println("3. Создать объект класса Самолет, используя класс Крыло. Методы: ле-тать, задавать маршрут, вывести на консоль маршрут.");
		System.out.println("4. Создать объект класса Беларусь, используя класс Область. Методы: вывести на консоль столицу, количество областей, площадь, областные центры.");
		System.out.println("5. Создать объект класса Планета, используя класс Материк. Методы: вы-вести на консоль название материка, планеты, количество материков.");
		System.out.println("6. Создать объект класса Звездная система, используя классы Планета, Звезда, Луна. Методы: вывести на консоль количество планет в звезд-ной системе,  название звезды, добавление планеты в систему.");
		System.out.println("7. Создать объект класса Компьютер, используя классы Винчестер, Дисковод, ОЗУ. Методы: включить, выключить, проверить на вирусы, вывести на консоль размер винчестера.");
		System.out.println("8. Создать объект класса Квадрат, используя классы Точка, Отрезок. Методы: задание размеров, растяжение, сжатие, поворот, изменение цвета.");
		System.out.println("9. Создать объект класса Круг, используя классы Точка, Окружность. Методы: задание размеров, изменение радиуса, определение принад-лежности точки данному кругу.");
		System.out.println("10. Создать объект класса Котёнок, используя классы Животное, Кошка. Методы: вывести на консоль имя, подать голос, рожать потомство (со-здавать себе подобных).");
		System.out.println("11. Создать объект класса Наседка, используя классы Птица, Кукушка. Методы: летать, петь, нести яйца, высиживать птенцов.");
		System.out.println("12. Создать объект класса Текстовый файл, используя класс Файл. Мето-ды: создать, переименовать, вывести на консоль содержимое, допол-нить, удалить.");
		System.out.println("13. Создать объект класса Одномерный массив, используя класс Массив. Методы: создать, вывести на консоль, выполнить операции (сложить, вычесть, перемножить).");
		System.out.println("14. Создать объект класса Простая дробь, используя класс Число. Мето-ды: вывод на экран, сложение, вычитание, умножение, деление.");
		System.out.println("15. Создать объект класса Дом, используя классы Окно, Дверь. Методы: закрыть на ключ, вывести на консоль количество окон, дверей.");
		System.out.println("16. Создать объект класса Роза, используя классы Лепесток, Бутон. Мето-ды: расцвести, завять, вывести на консоль цвет бутона.");
		System.out.println("17. Создать объект класса Дерево, используя классы Лист. Методы: зацве-сти, опасть листьям, покрыться инеем, пожелтеть листьям.");
		System.out.println("18. Создать объект класса Пианино, используя класс Клавиша. Методы: настроить, играть на пианино, нажимать клавишу.");
		System.out.println("19. Создать объект класса Фотоальбом, используя класс Фотография. Методы: задать название фотографии, дополнить фотоальбом фотогра-фией, вывести на консоль количество фотографий.");
		System.out.println("20. Создать объект класса Год, используя классы Месяц, День. Методы: задать дату, вывести на консоль день недели по заданной дате, рассчи-тать количество дней, месяцев в заданном временном промежутке.");
		System.out.println("21. Создать объект класса Сутки, используя классы Час, Минута. Мето-ды: вывести на консоль текущее время, рассчитать время суток (утро, день, вечер, ночь).");
		System.out.println("22. Создать объект класса Птица, используя класс Крылья. Методы: ле-тать, питаться.");
		System.out.println("23. Создать объект класса Тигр, используя класс Когти. Методы: рычать, бежать, добывать пищу.");
		System.out.println("24. Создать объект класса Гитара, используя класс Струна. Методы: иг-рать, натягивать струну.");	}

}
