package main.java.chapter.chapter03.variantB;

public class Main {

	public static void main(String[] args) {
		System.out.println("Реализовать методы сложения, вычитания, умножения и деления объектов (для тех классов, объекты которых могут поддерживать арифметические действия).");
		new main.java.chapter.chapter03.variantB.n1.Starter().run();
		System.out.println("2. Определить класс Комплекс. "
							+ "Создать массив/список/множество размерности n из комплексных координат. "
							+ "Передать его в метод, который выполнит сложение/умножение его элементов.");
		System.out.println("3. Определить класс Квадратное уравнение. "
							+ "Реализовать методы для поиска корней, экстремумов, а также интервалов убывания/возрастания. "
							+ "Создать массив/список/множество объектов и определить наибольшие и наименьшие по значению корни.");
		System.out.println("4. Определить класс Полином степени n. "
							+ "Объявить массив/список/множество из m полиномов и определить сумму полиномов массива.");
		System.out.println("5. Определить класс Интервал с учетом включения/невключения концов. "
							+ "Создать методы по определению пересечения и объединения интервалов, причем интервалы, не имеющие общих точек, пересекаться/объединятся не могут. "
							+ "Объявить массив/список/множество и n интервалов и определить расстояние между самыми удаленными концами.");
		System.out.println("6. Определить класс Точка на плоскости (в пространстве) и во времени. "
							+ "Задать движение точки в определенном направлении. "
							+ "Создать методы по определению скорости и ускорения точки. "
							+ "Проверить для двух точек возможность пересечения траекторий. "
							+ "Определить расстояние между двумя точками в заданный момент времени.");
		System.out.println("7. Определить класс Треугольник на плоскости. "
							+ "Определить площадь и периметр треугольника. "
							+ "Создать массив/список/множество объектов и подсчитать количество треугольников разного типа (равносторонний, равнобедренный, прямоугольный, произвольный). "
							+ "Определить для каждой группы наибольший и наименьший по площади (периметру) объект.");
		System.out.println("8. Определить класс Четырехугольник на плоскости. "
							+ "Определить площадь и периметр четырехугольника. "
							+ "Создать массив/список/множество объектов и подсчитать количество четырехугольников разного типа (квадрат, прямоу-гольник, ромб, произвольный). "
							+ "Определить для каждой группы наибольший и наименьший по площади (периметру) объект.");
		System.out.println("9. Определить класс Окружность на плоскости. "
							+ "Определить площадь и периметр. "
							+ "Создать массив/список/множество объектов и определить группы окружностей, центры которых лежат на одной прямой. "
							+ "Определить наибольший и наименьший по площади (периметру) объект.");
		System.out.println("10. Определить класс Прямая на плоскости (пространстве). "
							+ "Определить точки пересечения прямой с осями координат. "
							+ "Определить координаты пересечения двух прямых. "
							+ "Создать массив/список/множество объектов и определить группы параллельных прямых.");
		}

}
