package main.java.chapter.chapter03.variantB;

public class Main {

	public static void main(String[] args) {
		System.out.println("Реализовать методы сложения, вычитания, умножения и деления объектов (для тех классов, объекты которых могут поддерживать арифметические действия).");
		new main.java.chapter.chapter03.variantB.n1.Starter().run();
		new main.java.chapter.chapter03.variantB.n2.Starter().run();
		new main.java.chapter.chapter03.variantB.n3.Starter().run();
		new main.java.chapter.chapter03.variantB.n4.Starter().run();
		new main.java.chapter.chapter03.variantB.n5.Starter().run();
		System.out.println("6. Определить класс Точка на плоскости (в пространстве) и во времени. "
							+ "Задать движение точки в определенном направлении. "
							+ "Создать методы по определению скорости и ускорения точки. "
							+ "Проверить для двух точек возможность пересечения траекторий. "
							+ "Определить расстояние между двумя точками в заданный момент времени.");
		System.out.println("7. Определить класс Треугольник на плоскости. "
							+ "Определить площадь и периметр треугольника. "
							+ "Создать массив/список/множество объектов и подсчитать количество треугольников разного типа (равносторонний, равнобедренный, прямоугольный, произвольный). "
							+ "Определить для каждой группы наибольший и наименьший по площади (периметру) объект.");
		System.out.println("8. Определить класс Четырехугольник на плоскости. "
							+ "Определить площадь и периметр четырехугольника. "
							+ "Создать массив/список/множество объектов и подсчитать количество четырехугольников разного типа (квадрат, прямоу-гольник, ромб, произвольный). "
							+ "Определить для каждой группы наибольший и наименьший по площади (периметру) объект.");
		System.out.println("9. Определить класс Окружность на плоскости. "
							+ "Определить площадь и периметр. "
							+ "Создать массив/список/множество объектов и определить группы окружностей, центры которых лежат на одной прямой. "
							+ "Определить наибольший и наименьший по площади (периметру) объект.");
		System.out.println("10. Определить класс Прямая на плоскости (пространстве). "
							+ "Определить точки пересечения прямой с осями координат. "
							+ "Определить координаты пересечения двух прямых. "
							+ "Создать массив/список/множество объектов и определить группы параллельных прямых.");
		}

}
