package main.java.chapter.chapter09.variantB;

public class Main {

	public static void main(String[] args) {
		System.out.println("Выполнить задания из варианта B главы 4, сохраняя объекты приложения в\r\n" + 
				"одном или нескольких файлах с применением механизма сериализации. Объекты могут содержать поля, помеченные как static, а также transient. Для изме-нения информации и извлечения информации в файле создать специальный класс-коннектор с необходимыми для выполнения этих задач методами.");
	}

}
