package main.java.chapter.chapter08.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("Выполнить задания на основе варианта А главы 4, контролируя состояние по-\r\n" + 
				"токов ввода/вывода. При возникновении ошибок, связанных с корректностью вы-полнения математических операций, генерировать и обрабатывать исключитель-ные ситуации. Предусмотреть обработку исключений, возникающих при нехватке памяти, отсутствии требуемой записи (объекта) в файле, недопустимом значении поля и т.д.");
	}

}
