package main.java.chapter.chapter2.variantA;

import java.util.Scanner;

public class Chapter2VariantA {
	Scanner sc = new Scanner(System.in);
	int countLinesToInput;
	String[] arrString;
	public static void main(String[] args) {
		Chapter2VariantA chapter2 = new Chapter2VariantA();
		System.out.println(
				"1. Ввести n строк с консоли, найти самую короткую и самую длинную строки. Вывести найденные строки и их длину.");
		chapter2.task1();
		System.out.println(
				"2. Ввести n строк с консоли. Упорядочить и вывести строки в порядке возрастания (убывания) значений их длины.");
		chapter2.task2();
		System.out.println(
				"3. Ввести n строк с консоли. Вывести на консоль те строки, длина кото-рых меньше (больше) средней, а также длину.");
		chapter2.task3();
		System.out.println(
				"4. Ввести n слов с консоли. Найти слово, в котором число различных символов минимально. Если таких слов несколько, найти первое из них.");
		chapter2.task4();
		System.out.println(
				"5. Ввести n слов с консоли. Найти количество слов,  содержащих только символы латинского алфавита, а среди них – количество слов с равным числом гласных и согласных букв.");
		chapter2.task5();
		System.out.println(
				"6. Ввести n слов с консоли. Найти слово,  символы в котором идут в стро-гом порядке возрастания их кодов. Если таких слов несколько, найти первое из них.");
		chapter2.task6();
		System.out.println(
				"7. Ввести n слов с консоли. Найти слово,  состоящее только из различных символов. Если таких слов несколько, найти первое из них.");
		chapter2.task7();
		System.out.println(
				"8. Ввести n слов с консоли. Среди слов, состоящих только из цифр, найти слово-палиндром. Если таких слов больше одного, найти вто-рое из них.");
		chapter2.task8();
		System.out.println(
				"9. Написать программы решения задач 1–8, осуществляя ввод строк как аргументов командной строки.");
		chapter2.task9();
		System.out.println(
				"10. Используя оператор switch, написать программу, которая выводит на экран сообщения о принадлежности некоторого значения k интерва-лам (-10k, 0], (0, 5], (5, 10], (10, 10k].");
		chapter2.task10();
		System.out.println(
				"11. Используя оператор switch, написать программу, которая выводит на экран сообщения о принадлежности некоторого значения k интервалам (-10k, 5], [0, 10], [5, 15], [10, 10k].");
		chapter2.task11();
		System.out.println(
				"12. Написать программу, которая выводит числа от 1 до 25 в виде матрицы 5x5 слева направо и сверху вниз.");
		chapter2.task12();
		System.out.println(
				"13. Написать программу, позволяющую корректно находить корни квад-ратного уравнения. Параметры уравнения должны задаваться с ко-мандной строки.");
		chapter2.task13();
		System.out.println(
				"14. Ввести число от 1 до 12. Вывести на консоль название месяца, соответ-ствующего данному числу. (Осуществить проверку корректности ввода чисел).");
		chapter2.task14();

	}

//	1. Ввести n строк с консоли, найти самую короткую и самую длинную строки. Вывести найденные строки и их длину.
	public void task1() {
	}

//	2. Ввести n строк с консоли. Упорядочить и вывести строки в порядке возрастания (убывания) значений их длины.
	public void task2() {
	}

//	3. Ввести n строк с консоли. Вывести на консоль те строки, длина кото-рых меньше (больше) средней, а также длину.
	public void task3() {
	}

//	4. Ввести n слов с консоли. Найти слово, в котором число различных символов минимально. Если таких слов несколько, найти первое из них.
	public void task4() {
	}

//	5. Ввести n слов с консоли. Найти количество слов,  содержащих только символы латинского алфавита, а среди них – количество слов с равным числом гласных и согласных букв.
	public void task5() {
	}

//	6. Ввести n слов с консоли. Найти слово,  символы в котором идут в стро-гом порядке возрастания их кодов. Если таких слов несколько, найти первое из них.
	public void task6() {
	}

//	7. Ввести n слов с консоли. Найти слово,  состоящее только из различных символов. Если таких слов несколько, найти первое из них.
	public void task7() {
	}

//	8. Ввести n слов с консоли. Среди слов, состоящих только из цифр, найти слово-палиндром. Если таких слов больше одного, найти вто-рое из них.
	public void task8() {
	}

//	9. Написать программы решения задач 1–8, осуществляя ввод строк как аргументов командной строки.
	public void task9() {
	}

//	10. Используя оператор switch, написать программу, которая выводит на экран сообщения о принадлежности некоторого значения k интерва-лам (-10k, 0], (0, 5], (5, 10], (10, 10k].
	public void task10() {
	}

//	11. Используя оператор switch, написать программу, которая выводит на экран сообщения о принадлежности некоторого значения k интервалам (-10k, 5], [0, 10], [5, 15], [10, 10k].
	public void task11() {
	}

//	12. Написать программу, которая выводит числа от 1 до 25 в виде матрицы 5x5 слева направо и сверху вниз.
	public void task12() {
	}

//	13. Написать программу, позволяющую корректно находить корни квад-ратного уравнения. Параметры уравнения должны задаваться с ко-мандной строки.
	public void task13() {
	}

//	14. Ввести число от 1 до 12. Вывести на консоль название месяца, соответ-ствующего данному числу. (Осуществить проверку корректности ввода чисел).
	public void task14() {
	}

}
