package main.java.chapter.chapter09.variantC;

public class Main {

	public static void main(String[] args) {
		System.out.println("При выполнении следующих заданий для вывода результатов создавать новую директорию и файл средствами класса File.");
		System.out.println("1. Создать и заполнить файл случайными целыми числами. Отсортировать содержимое файла по возрастанию.");
		System.out.println("2. Прочитать текст Java-программы и все слова public в объявлении ат-рибутов и методов класса заменить на слово private.");
		System.out.println("3. Прочитать текст Java-программы и записать в другой файл в обратном порядке символы каждой строки.");
		System.out.println("4. Прочитать текст Java-программы и в каждом слове длиннее двух сим-волов все строчные символы заменить прописными.");
		System.out.println("5. В файле, содержащем фамилии студентов и их оценки, записать про-писными буквами фамилии тех студентов, которые имеют средний балл более “7”.");
		System.out.println("6. Файл содержит символы, слова, целые числа и числа с плавающей за-пятой. Определить все данные, тип которых вводится из командной строки.");
		System.out.println("7. Из файла удалить все слова, содержащие от трех до пяти символов, но при этом из каждой строки должно быть удалено только максимальное четное количество таких слов.");
		System.out.println("8. Прочитать текст Java-программы и удалить из него все “лишние” про-белы и табуляции, оставив только необходимые для разделения опера-торов.");
		System.out.println("9. Из текста Java-программы удалить все виды комментариев.");
		System.out.println("10. Прочитать строки из файла и поменять местами первое и последнее слова в каждой строке.");
		System.out.println("11. Ввести из текстового файла, связанного с входным потоком, последовательность строк. Выбрать и сохранить m последних слов в каждой из последних n строк.");
		System.out.println("12. Из текстового файла ввести последовательность строк. Выделить от-дельные слова, разделяемые пробелами. Написать метод поиска слова по образцу-шаблону. Вывести найденное слово в другой файл.");
		System.out.println("13. Сохранить в файл, связанный с выходным потоком, записи о телефонах и их владельцах. Вывести в файл записи, телефоны которых начинают-ся на k и на j.");
		System.out.println("14. Входной файл содержит совокупность строк. Строка файла содержит строку квадратной матрицы. Ввести матрицу в двумерный массив (раз-мер матрицы найти). Вывести исходную матрицу и результат ее транс-понирования.");
		System.out.println("15. Входной файл хранит квадратную матрицу по принципу: строка пред-ставляет собой число. Определить размерность. Построить 2-мерный массив, содержащий матрицу. Вывести исходную матрицу и резуль-тат ее поворота на 90 градусов по часовой стрелке.");
		System.out.println("16. В файле содержится совокупность строк. Найти номера строк, совпа-дающих с заданной строкой. Имя файла и строка для поиска – аргумен-ты командной строки. Вывести строки файла и номера строк, совпада-ющих с заданной.");
		}

}
