package main.java.chapter.chapter15.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("Создать на основе сокетов клиент/серверное визуальное приложение:");
		System.out.println("1. Клиент посылает через сервер сообщение другому клиенту.");
		System.out.println("2. Клиент посылает через сервер сообщение другому клиенту, выбранному из списка.");
		System.out.println("3. Чат. Клиент посылает через сервер сообщение, которое получают все клиенты. Список клиентов хранится на сервере в файле.");
		System.out.println("4. Клиент при обращении к серверу получает случайно выбранный сонет Шекспира из файла.");
		System.out.println("5. Сервер рассылает сообщения выбранным из списка клиентам. Список хранится в файле.");
		System.out.println("6. Сервер рассылает сообщения в определенное время определенным клиентам.");
		System.out.println("7. Сервер рассылает сообщения только тем клиентам, которые в настоящий момент находятся в on-line.");
		System.out.println("8. Чат. Сервер рассылает всем клиентам информацию о клиентах, вошедших в чат и покинувших его.");
		System.out.println("9. Клиент выбирает изображение из списка и пересылает его другому клиенту через сервер.");
		System.out.println("10. Игра по сети в “Морской бой”.");
		System.out.println("11. Игра по сети в “21”.");
		System.out.println("12. Игра по сети “Го”. Крестики-нолики на безразмерном (большом) поле. Для победы необходимо выстроить пять в один ряд.");
		System.out.println("13. Написать программу, сканирующую сеть в указанном диапазоне IP адресов на наличие активных компьютеров.");
		System.out.println("14. Прокси. Программа должна принимать сообщения от любого клиента, работающего на протоколе TCP, и отсылать их на соответствующий сервер. При передаче изменять сообщение.");
		System.out.println("15. Телнет. Создать программу, которая соединяется с указанным сервером по указанному порту и производит обмен текстовой информацией.");
		}

}
