package main.java.chapter.chapter21.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("Для всех заданий использовать авторизованный вход в приложение. Параметры авторизации, дату входа в приложение и время работы сохранять в сессии. 1. В тексте, хранящемся в файле, определить длину содержащейся в нем максимальной серии символов, отличных от букв. Все такие серии сим-волов с найденной длиной сохранить в cookie.");
		System.out.println("2. В файле хранится текст. Для каждого из слов, которые вводятся в тек-стовые поля HTML-документа, вывести в файл cookie, сколько раз они встречаются в тексте.");
		System.out.println("3. В файле хранится несколько стихотворений, которые разделяются стро-кой, состоящей из одних звездочек. В каком из стихотворений больше всего восклицательных предложений? Результат сохранить в файле cookie.");
		System.out.println("4. Записать в файл cookie все вопросительные предложения текста, кото-рые хранятся в текстовом файле.");
		System.out.println("5. Код программы хранится в файле. Подсчитать количество операторов этой программы и записать результаты поиска в файл cookie, перечис-лив при этом все найденные операторы.");
		System.out.println("6. Код программы хранится в файле. Сформировать файл cookie, записи которого дополнительно слева содержат уровень вложенности циклов. Ограничения на входные данные:");
		System.out.println("	а) ключевые слова используются только для обозначения операторов; ");
		System.out.println("	б) операторы цикла записываются первыми в строке.");
		System.out.println("7. Подсчитать, сколько раз в исходном тексте программы, хранящейся на диске, встречается оператор, который вводится с терминала. Сохранить в файле cookie также номера строк, в которых этот оператор записан. Ограничения: ключевые слова используются только для обозначения операторов.");
		System.out.println("8. Сохранить в cookie информацию, введенную пользователем, и восста-новить ее при следующем обращении к странице.");
		System.out.println("9. Выбрать из текстового файла все числа-полиндромы и их количество. Результат сохранить в файле cookie.");
		System.out.println("10. В файле хранится текст. Найти три предложения, содержащие наибольшее количество знаков препинания, и сохранить их в файле cookie.");
		System.out.println("11. Подсчитать количество различных слов в файле и сохранить информа-цию в файл cookie.");
		System.out.println("12. В файле хранится код программы. Удалить из текста все комментарии и записать измененный файл в файл cookie.");
		System.out.println("13. В файле хранится HTML-документ. Проверить его на правильность и записать в файл cookie первую строку и позицию (если они есть), нарушающую правильность документа.");
		System.out.println("14. В файле хранится HTML-документ. Найти и вывести все незакрытые теги с указанием строки и позиции начала в файл cookie. При выполне-нии задания учесть возможность присутствия тегов, которые не требу-ется закрывать. Например: <BR>.");
		System.out.println("15. В файле хранится HTML-документ с незакрытыми тегами. Закрыть все незакрытые теги так, чтобы документ HTML стал правильным, и запи-сать измененный файл в файл cookie. При выполнении задания учесть возможность присутствия тегов, которые не требуется закрывать. Например: <BR>.");
		System.out.println("16. В файле хранятся слова русского языка и их эквивалент на английском языке. Осуществить перевод введенного пользователем текста и запи-сать его в файл cookie.");
		System.out.println("17. Выбрать из файла все адреса электронной почты и сохранить их в фай-ле cookie.");
		System.out.println("18. Выбрать из файла имена зон (*.by, *.ru и т.д.), вводимые пользователем, и сохранить их в файле cookie.");
		System.out.println("19. Выбрать из файла все заголовки разделов и подразделов (оглавление) и записать их в файл cookie.");
		System.out.println("20. При работе приложения сохранять в сессии имена всех файлов, к кото-рым обращался пользователь.");
		}

}
