package main.java.chapter.chapter09.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("В следующих заданиях требуется ввести последовательность строк из текстового потока и выполнить указанные действия. При этом могут рассматриваться два варианта:");
		System.out.println("	 каждая строка состоит из одного слова;");
		System.out.println("	 каждая строка состоит из нескольких слов.");
		System.out.println("Имена входного и выходного файлов, а также абсолютный путь к ним могут быть введены как параметры командной строки или храниться в файле.");
		System.out.println("1. В каждой строке найти и удалить заданную подстроку.");
		System.out.println("2. В каждой строке стихотворения Александра Блока найти и заменить заданную подстроку на подстроку иной длины.");
		System.out.println("3. В каждой строке найти слова, начинающиеся с гласной буквы.");
		System.out.println("4. Найти и вывести слова текста, для которых последняя буква одного слова совпадает с первой буквой следующего слова.");
		System.out.println("5. Найти в строке наибольшее число цифр, идущих подряд.");
		System.out.println("6. В каждой строке стихотворения Сергея Есенина подсчитать частоту повторяемости каждого слова из заданного списка и вывести эти слова в порядке возрастания частоты повторяемости.");
		System.out.println("7. В каждом слове сонета Вильяма Шекспира заменить первую букву сло-ва на прописную.");
		System.out.println("8. Определить частоту повторяемости букв и слов в стихотворении Алек-сандра Пушкина.");
		}

}
