package main.java.chapter.chapter05.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("Выполнить описание логики системы и использовать шаблоны проектирования для определения организации классов разрабатываемой системы. Использо-вать объекты классов и подклассов для моделирования реальных ситуаций и вза-имодействий объектов.");
		System.out.println("1. Создать суперкласс Транспортное средство и подклассы Автомо-биль, Велосипед, Повозка. Подсчитать время и стоимость перевозки пассажиров и грузов каждым транспортным средством.");
		System.out.println("2. Создать суперкласс Пассажироперевозчик и подклассы Самолет, По-езд, Автомобиль. Задать правила выбора транспорта в зависимости от расстояния и наличия путей сообщения.");
		System.out.println("3. Создать суперкласс Учащийся и подклассы Школьник и Студент. Определить способы обучения и возможности его продолжения.");
		System.out.println("4. Создать суперкласс Музыкальный инструмент и классы Ударный, Струнный, Духовой. Определить правила организации и управления оркестром.");
		System.out.println("5. Создать суперкласс Животное и подклассы Собака, Кошка, Тигр, Мустанг, Дельфин. С помощью шаблонов задать способы обитания.");
		System.out.println("6. Создать базовый класс Садовое дерево и производные классы Яблоня, Вишня, Груша, Слива. Принять решение о пересадке каждого дерева в зависимости от возраста и плодоношения.");	}

}
