package main.java.chapter.chapter18.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("Создать сервлет и взаимодействующие с ним пакеты Java-классов и JSP-страницы, выполняющие следующие действия:");
		System.out.println("1. Генерация таблиц по переданным параметрам: заголовок, количество строк и столбцов, цвет фона.");
		System.out.println("2. Вычисление тригонометрических функций в градусах и радианах с указанной точностью. Выбор функций должен осуществляться через вы-падающий список.");
		System.out.println("3. Поиск слова, введенного пользователем. Поиск и определение частоты встречаемости осуществляется в текстовом файле, расположенном на сервере.");
		System.out.println("4. Вычисление объемов тел (параллелепипед, куб, сфера, тетраэдр, тор, шар, эллипсоид и т.д.) с точностью и параметрами, указываемыми пользователем.");
		System.out.println("5. Поиск и (или) замена информации в коллекции по ключу (значе-нию).");
		System.out.println("6. Выбор текстового файла из архива файлов по разделам (поэзия, проза, фантастика и т.д.) и его отображение.");
		System.out.println("7. Выбор изображения по тематике (природа, автомобили, дети и т.д.) и его отображение.");
		System.out.println("8. Информация о среднесуточной температуре воздуха за месяц задана в виде списка, хранящегося в файле. Определить:");
		System.out.println("	а) среднемесячную температуру воздуха; ");
		System.out.println("	б) количество дней, когда температура была выше среднемесячной; ");
		System.out.println("	в) количество дней, когда температура опускалась ниже 0ºC; ");
		System.out.println("	г) три самых теплых дня.");
		System.out.println("9. Игра с сервером в “21”.");
		System.out.println("10. Реализация адаптивного теста из цепочки в 3–4 вопроса.");
		System.out.println("11. Определение значения полинома в заданной точке. Степень полинома и его коэффициенты вводятся пользователем.");
		System.out.println("12. Вывод фрагментов текстов шрифтами различного размера. Размер шрифта и количество строк задаются на стороне клиента.");
		System.out.println("13. Информация о точках на плоскости хранится в файле. Выбрать все точ-ки, наиболее приближенные к заданной прямой. Параметры прямой и максимальное расстояние от точки до прямой вводятся на стороне клиента.");
		System.out.println("14. Осуществить сортировку введенного пользователем массива целых чи-сел. Числа вводятся через запятую.");
		System.out.println("15. Реализовать игру с сервером в крестики-нолики.");
		System.out.println("16. Осуществить форматирование выбранного пользователем текстового файла, так чтобы все абзацы имели отступ ровно 3 пробела, а длина каждой строки была ровно 80 символов и не имела начальными и ко-нечными символами пробел.");
		}

}
