package main.java.chapter.chapter06.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("1. Создать класс Notepad (записная книжка) с внутренним классом или классами, с помощью объектов которого могут храниться несколько записей на одну дату.");
		System.out.println("2. Создать класс Payment (покупка) с внутренним классом, с помощью объектов которого можно сформировать покупку из нескольких това-ров.");
		System.out.println("3. Создать класс Account (счет) с внутренним классом, с помощью объек-тов которого можно хранить информацию обо всех операциях со сче-том (снятие, платежи, поступления).");
		System.out.println("4. Создать класс Зачетная Книжка с внутренним классом, с помощью объектов которого можно хранить информацию о сессиях, зачетах, эк-заменах.");
		System.out.println("5. Создать класс Department (отдел фирмы) с внутренним классом, с по-мощью объектов которого можно хранить информацию обо всех долж-ностях отдела и обо всех сотрудниках, когда-либо занимавших кон-кретную должность.");
		System.out.println("6. Создать класс Catalog (каталог) с внутренним классом, с помощью объектов которого можно хранить информацию об истории выдач кни-ги читателям.");
		System.out.println("7. Создать класс СССР с внутренним классом, с помощью объектов кото-рого можно хранить информацию об истории изменения территориаль-ного деления на области и республики.");
		System.out.println("8. Создать класс City (город) с внутренним классом, с помощью объектов которого можно хранить информацию о проспектах, улицах, площадях. ");
		System.out.println("9. Создать класс CD (mp3-диск) с внутренним классом, с помощью объектов которого можно хранить информацию о каталогах, подкаталогах и записях.");
		System.out.println("10. Создать класс Mobile с внутренним классом, с помощью объектов которого можно хранить информацию о моделях телефонов и их свойствах. ");
		System.out.println("11. Создать класс Художественная Выставка с внутренним классом, с помощью объектов которого можно хранить информацию о картинах,авторах и времени проведения выставок.");
		System.out.println("12. Создать класс Календарь с внутренним классом, с помощью объектов которого можно хранить информацию о выходных и праздничных днях.");
		System.out.println("13. Создать класс Shop (магазин) с внутренним классом, с помощью объ-ектов которого можно хранить информацию об отделах, товарах и услуг.");
		System.out.println("14. Создать класс Cправочная Cлужба Oбщественного Tранспорта с внутренним классом, с помощью объектов которого можно хранить информацию о времени, линиях маршрутов и стоимости проезда.");
		System.out.println("15. Создать класс Computer (компьютер) с внутренним классом, с помо-щью объектов которого можно хранить информацию об операционной системе, процессоре и оперативной памяти.");
		System.out.println("16. Создать класс Park (парк) с внутренним классом, с помощью объектов которого можно хранить информацию об аттракционах, времени их ра-боты и стоимости.");
		System.out.println("17. Создать класс Cinema (кино) с внутренним классом, с помощью объек-тов которого можно хранить информацию об адресах кинотеатров, фильмах и времени сеансов.");
		System.out.println("18. Создать класс Программа Передач с внутренним классом, с помощью объектов которого можно хранить информацию о названии телеканалов и программ.");
		System.out.println("19. Создать класс Фильм с внутренним классом, с помощью объектов ко-торого можно хранить информацию о продолжительности, жанре и ре-жиссерах фильма.");
		}

}
