package main.java.chapter.chapter12.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("1. Создать фрейм с областью для рисования “пером”. Создать меню для выбора цвета и толщины линии.");
		System.out.println("2. Создать апплет с областью для рисования “пером”. Создать меню для выбора цвета и толщины линии.");
		System.out.println("3. Создать фрейм с областью для рисования. Добавить кнопки для выбора цвета (каждому цвету соответствует своя кнопка), кнопку для очистки окна. Рисование на панели со скроллингом.");
		System.out.println("4. Создать апплет с областью для рисования. Добавить кнопки для выбора цвета (каждому цвету соответствует своя кнопка), кнопку для очистки окна. Рисование на панели со скроллингом.");
		System.out.println("5. Создать простой текстовый редактор, содержащий меню и использующий классы диалогов для открытия и сохранения файлов.");
		System.out.println("6. Создать апплет, содержащий (JLabel) с текстом “Простой апплет”, кнопку и текстовое поле (JTextField), в которое при каждом нажа-тии на кнопку выводится по одной строке из текстового файла.");
		System.out.println("7. Изменить апплет для предыдущей задачи таким образом, чтобы он мог работать и как апплет, и как приложение.");
		System.out.println("8. Составить программу для управления скоростью движения точки по аппле-ту. Одна кнопка увеличивает скорость, другая – уменьшает. Каждый щелчок изменяет скорость на определенную величину.");
		System.out.println("9. Изобразить в окне гармонические колебания точки вдоль некоторого горизонтального отрезка. Если длина отрезка равна q, то расстояние от точки до левого конца в момент времени t можно считать равным q(1 + cos(wt))/2, где w – некоторая константа. Предусмотреть поля для ввода указанных величин и кнопку для остановки и пуска процесса.");
		System.out.println("10. Для предыдущей задачи предусмотреть возможность управления ча-стотой колебаний с помощью двух кнопок. С помощью других двух кнопок (можно клавиш) управлять амплитудой, т.е. величиной q.");
		System.out.println("11. Построить в апплете ломаную линию по заданным вершинам. Коорди-наты вершин вводятся через текстовое поле и фиксируются нажатием кнопки.");
		System.out.println("12. Нарисовать в апплете окружность с координатами центра и радиусом, вводимыми через текстовые поля.");
		System.out.println("13. Cоздать апплет со строкой, которая движется горизонтально, отражаясь от границ апплета и меняя при этом свой цвет на цвет, выбранный из выпадающего списка.");
		System.out.println("14. Cоздать апплет со строкой, движущейся по диагонали. При достижении границ апплета все символы строки случайным образом меняют ре-гистр. При этом шрифт меняется на шрифт, выбранный из списка.");
		}

}
