package main.java.chapter.chapter11.variantA;

public class Main {

	public static void main(String[] args) {
		System.out.println("В следующих заданиях выполнить рисунок в окне апплета или фрейма.");
		System.out.println("1. Создать классы Point и Line. Объявить массив из n объектов класса Point. Для объекта класса Line определить, какие из объектов Point ле-жат на одной стороне от прямой линии и какие на другой. Реализовать ввод данных для объекта Line и случайное задание данных для объекта Point.");
		System.out.println("2. Создать классы Point и Line. Объявить массив из n объектов класса Point и определить в методе, какая из точек находится дальше всех от прямой линии.");
		System.out.println("3. Создать класс Triangle и класс Point. Объявить массив из n объектов класса Point, написать функцию, определяющую, какая из точек лежит внутри, а какая – снаружи треугольника.");
		System.out.println("4. Определить класс Rectangle и класс Point. Объявить массив из n объек-тов класса Point. Написать функцию, определяющую, какая из точек ле-жит снаружи, а какая – внутри прямоугольника.");
		System.out.println("5. Реализовать полиморфизм на основе абстрактного класса AnyFigure и его методов. Вывести координаты точки, треугольника, тетраэдра.");
		System.out.println("6. Определить класс Line для прямых линий, проходящих через точки A(x1, y1) и B(x2, y2). Создать массив объектов класса Line. Определить,используя функции, какие из прямых линий пересекаются, а какие сов-падают. Нарисовать все пересекающиеся прямые.");
		System.out.println("Задать движение по экрану строк (одна за другой) из массива строк.");
		System.out.println("Направление движения по апплету и значение каждой строки выбира-ются случайным образом.");
		System.out.println("9. Задать составление строки из символов, появляющихся из разных углов апплета и выстраивающихся друг за другом. Процесс должен цикличе-ски повторяться.");
		System.out.println("10. Задать движение окружности по апплету так, чтобы при касании гра-ницы окружность отражалась от нее с эффектом упругого сжатия.");
		System.out.println("11. Изобразить в апплете приближающийся издали шар, удаляющийся шар. Шар должен двигаться с постоянной скоростью.");
		System.out.println("12. Изобразить в окне приложения (апплета) отрезок, вращающийся в плоскости экрана вокруг одной из своих концевых точек. Цвет пря-мой должен изменяться при переходе от одного положения к другому.");
		System.out.println("13. Изобразить в окне приложения (апплета) отрезок, вращающийся в плоскости фрейма вокруг точки, движущейся по отрезку.");
		System.out.println("14. Изобразить четырехугольник, вращающийся в плоскости апплета во-круг своего центра тяжести.");
		System.out.println("15. Изобразить прямоугольник, вращающийся в плоскости фрейма вокруг одной из своих вершин.");
		System.out.println("16. Изобразить разносторонний треугольник, вращающийся в плоскости апплета вокруг своего центра тяжести.");
		}

}
